#coding=utf-8
from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.support.ui import Select
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import time


def barPlot(data, tick, colors=None, total_width=0.8, single_width=1):
    if colors is None:
        colors = plt.rcParams['axes.prop_cycle'].by_key()['color']
    n_bars = len(data)
    bar_width = total_width / n_bars
    bars = []
    for i, (name, values) in enumerate(data.items()):
        x_offset = (i - n_bars / 2) * bar_width + bar_width / 2
        bar = plt.bar(np.arange(len(values)) + x_offset, values, width=bar_width * single_width, tick_label=tick, label=name, color=colors[i % len(colors)])
        bars.append(bar)
    for bar in bars:
        plt.bar_label(bar, fmt='%.0f', label_type='edge')
    plt.legend(loc='best')


def drawBarChart(data, column):
    label = [schoolName for schoolName in data]
    barData = {}
    for i in range(len(column)):
        attribute = column[i]
        barData[attribute] = [sum([int(data[schoolName]['肇因'][index][attribute]) for index in data[schoolName]['肇因']]) for schoolName in data]
    barPlot(barData, label, total_width=.8, single_width=.9)
    plt.show()


def getTableData(tableID, browser):
    table = browser.find_element(By.ID, tableID)
    data = {}
    keys = [td.get_attribute("innerText") for td in table.find_element(By.TAG_NAME, "thead").find_elements(By.TAG_NAME, "th")]
    keys.pop(0)
    for tr in table.find_element(By.TAG_NAME, "tbody").find_elements(By.TAG_NAME, "tr"):
        th = tr.find_element(By.TAG_NAME, "th")
        tds = tr.find_elements(By.TAG_NAME, "td")
        data[th.get_attribute("innerText")] = {}
        for i in range(len(keys)):
            data[th.get_attribute("innerText")][keys[i]] = tds[i].get_attribute("innerText")
    return data


if __name__ == "__main__":
    # url = "https://roadsafety.tw/SchoolHotSpots"
    # browser = webdriver.Chrome(service=Service("chromedriver.exe"))
    # browser.get(url)
    # data = {'東海大學':{}, '逢甲大學':{}, '僑光科技大學':{}}
    # browser.execute_script("setInterval(() => [...document.querySelectorAll('.modal.show .close')].forEach(e => e.click()), 300)")
    # body = browser.find_element(By.TAG_NAME, "body")
    # Select(browser.find_element(By.ID, "ddlSchoolType")).select_by_value("10708") # 選擇大專院校
    # Select(browser.find_element(By.ID, "ddlCity")).select_by_value("15") # 選擇台中市
    # for schoolName in data:
    #     Select(browser.find_element(By.ID, "ddlSchool")).select_by_visible_text(schoolName) # 選擇學校
    #     browser.find_element(By.ID, "bSearch").click()
    #     data[schoolName]['肇因'] = getTableData("tbCause", browser)
    #     data[schoolName]['年齡'] = getTableData("tbAges", browser)

    # 儲存成Excel
    # with pd.ExcelWriter('肇因.xlsx') as writer:
    #     for schoolName in data:
    #         pd.DataFrame(data[schoolName]['肇因']).T.to_excel(writer, schoolName)
    # with pd.ExcelWriter('年齡.xlsx') as writer:
    #     for schoolName in data:
    #         pd.DataFrame(data[schoolName]['年齡']).T.to_excel(writer, schoolName)
    data = {'東海大學': {'肇因': {'1': {'肇事原因': '未注意車前狀況', '件數': '5', '死亡': '0', '受傷': '5'}, '2': {'肇事原因': '未保持行車安全距離', '件數': '4', '死亡': '0', '受傷': '7'}, '3': {'肇事原因': '其他不當駕車行為', '件數': '4', '死亡': '0', '受傷': '4'}, '4': {'肇事原因': '其他未依規定讓車', '件數': '3', '死亡': '0', '受傷': '5'}, '5': {'肇事原因': '未保持行車安全間隔', '件數': '2', '死亡': '2', '受傷': '2'}, '6': {'肇事原因': '不明原因肇事', '件數': '2', '死亡': '0', '受傷': '2'}, '7': {'肇事原因': '起步時未注意安全', '件數': '2', '死亡': '0', '受傷': '2'}, '8': {'肇事原因': '違反特定標誌(線)禁制', '件數': '1', '死亡': '0', '受傷': '2'}, '9': {'肇事原因': '酒醉(後)駕駛', '件數': '1', '死亡': '0', '受傷': '1'}}, '年齡': {'1': {'年齡層': '25歲-29歲', '人數': '10', '死亡': '1', '受傷': '3'}, '2': {'年齡層': '20歲-24歲', '人數': '10', '死亡': '0', '受傷': '8'}, '3': {'年齡層': '30歲-34歲', '人數': '6', '死亡': '0', '受傷': '4'}, '4': {'年齡層': '40歲-44歲', '人數': '6', '死亡': '0', '受傷': '3'}, '5': {'年齡層': '18歲-19歲', '人數': '4', '死亡': '0', '受傷': '4'}, '6': {'年齡層': '35歲-39歲', '人數': '4', '死亡': '0', '受傷': '2'}, '7': {'年齡層': '不明', '人數': '4', '死亡': '0', '受傷': '0'}, '8': {'年齡層': '50歲-54歲', '人數': '3', '死亡': '0', '受傷': '2'}, '9': {'年齡層': '65歲-69歲', '人數': '2', '死亡': '0', '受傷': '2'}, '10': {'年齡層': '45歲-49歲', '人數': '2', '死亡': '0', '受傷': '1'}, '11': {'年齡層': '60歲-64歲', '人數': '2', '死亡': '0', '受傷': '1'}, '12': {'年齡層': '90歲以上', '人數': '1', '死亡': '1', '受傷': '0'}}}, '逢甲大學': {'肇因': {'1': {'肇事原因': '其他未依規定讓車', '件數': '30', '死亡': '0', '受傷': '48'}, '2': {'肇事原因': '其他不當駕車行為', '件數': '27', '死亡': '1', '受傷': '32'}, '3': {'肇事原因': '未注意車前狀況', '件數': '27', '死亡': '0', '受傷': '40'}, '4': {'肇事原因': '未保持行車安全距離', '件數': '25', '死亡': '0', '受傷': '36'}, '5': {'肇事原因': '起步時未注意安全', '件數': '15', '死亡': '0', '受傷': '22'}, '6': {'肇事原因': '迴轉未依規定', '件數': '12', '死亡': '0', '受傷': '16'}, '7': {'肇事原因': '變換車道不當', '件數': '8', '死亡': '0', '受傷': '13'}, '8': {'肇事原因': '不明原因肇事', '件數': '8', '死亡': '0', '受傷': '9'}, '9': {'肇事原因': '車輛未依規定暫停讓行人先行', '件數': '6', '死亡': '0', '受傷': '8'}, '10': {'肇事 原因': '有號誌路口，轉彎車未讓直行車先行', '件數': '5', '死亡': '0', '受傷': '8'}, '11': {'肇事原因': '相關跡證不足且無具體影像畫面，當事人各執一詞，經分析後無法釐清肇事原因', '件數': '5', '死亡': '0', '受傷': '7'}, '12': {'肇事原因': '違反特定標誌(線)禁制', '件數': '5', '死亡': '0', '受傷': '5'}, '13': {'肇事原因': '左轉彎未依規定', '件數': '4', '死亡': '0', '受傷': '7'}, '14': {'肇事原因': '車輛駕駛者-尚未發現肇事 因素', '件數': '4', '死亡': '0', '受傷': '7'}, '15': {'肇事原因': '違反號誌管制或指揮', '件數': '4', '死亡': '0', '受傷': '7'}, '16': {'肇事原因': '無號誌路口，左方車未讓右方車先行', '件數': '4', '死亡': '0', '受傷': '5'}, '17': {'肇事原因': '倒車未依規定', '件數': '4', '死亡': '0', '受傷': '4'}, '18': {'肇事原因': '無號誌路口，轉彎車未讓直行車先行', '件數': '3', '死亡': '0', '受傷': '7'}, '19': {'肇事原因': '未依規 定減速', '件數': '2', '死亡': '0', '受傷': '4'}, '20': {'肇事原因': '恍神、緊張、心不在焉分心駕駛', '件數': '2', '死亡': '0', '受傷': '3'}, '21': {'肇事原因': '違規超車', '件數': '2', '死亡': '0', '受傷': '2'}, '22': {'肇事原因': '方向不定(不包括危險駕駛))', '件數': '1', '死亡': '0', '受傷': '2'}, '23': {'肇事原因': '穿越道路未注意左右來車', '件數': '1', '死亡': '0', '受傷': '2'}, '24': {'肇事原因': '闖紅燈左轉(或迴 轉)', '件數': '1', '死亡': '0', '受傷': '2'}, '25': {'肇事原因': '闖紅燈直行', '件數': '1', '死亡': '0', '受傷': '2'}, '26': {'肇事原因': '未保持行車安全間隔', '件數': '1', '死亡': '0', '受傷': '1'}, '27': {'肇事原因': '其他-開啟或關閉車門不當', '件數': '1', '死亡': '0', '受傷': '1'}, '28': {'肇事原因': '酒醉(後)駕駛', '件數': '1', '死亡': '0', '受傷': '1'}, '29': {'肇事原因': '動物竄出', '件數': '1', '死亡': '0', ' 受傷': '1'}, '30': {'肇事原因': '無號誌路口，支線道未讓幹線道先行', '件數': '1', '死亡': '0', '受傷': '1'}, '31': {'肇事原因': '違反其他標誌(線)禁制', '件數': '1', '死亡': '0', '受傷': '1'}, '32': {'肇事原因': '違反禁止變換車道標線', '件數': '1', '死亡': '0', '受傷': '1'}, '33': {'肇事原因': '橫越道路不慎', '件數': '1', '死亡': '0', '受傷': '1'}}, '年齡': {'1': {'年齡層': '20歲-24歲', '人數': '132', '死亡': '0', '受 傷': '95'}, '2': {'年齡層': '18歲-19歲', '人數': '67', '死亡': '0', '受傷': '51'}, '3': {'年齡層': '25歲-29歲', '人數': '61', '死亡': '0', '受傷': '40'}, '4': {'年齡層': '30歲-34歲', '人數': '41', '死亡': '0', '受傷': '24'}, '5': {'年齡層': '35歲-39歲', '人數': '32', '死亡': '0', '受傷': '15'}, '6': {'年齡層': '40歲-44歲', '人數': '31', '死亡': '0', '受傷': '17'}, '7': {'年齡層': '45歲-49歲', '人數': '27', '死亡': '0', '受傷': '13'}, '8': {'年齡層': '50歲-54歲', '人數': '25', '死亡': '0', '受傷': '12'}, '9': {'年齡層': '55歲-59歲', '人數': '20', '死亡': '1', '受傷': '12'}, '10': {'年齡層': '不明', '人數': '17', '死亡': '0', '受傷': '0'}, '11': {'年齡層': '70歲-74歲', '人數': '9', '死亡': '0', '受傷': '6'}, '12': {'年齡層': '60歲-64歲', '人數': '8', '死亡': '0', '受傷': '5'}, '13': {'年齡層': '65歲-69歲', '人數': '6', '死亡': '0', '受傷': '5'}, '14': {'年齡層': '6歲-11歲', '人數': '3', '死亡': '0', '受傷': '3'}, '15': {'年齡層': '75歲-79歲', '人數': '3', '死亡': '0', '受傷': '2'}, '16': {'年齡層': '15歲', '人數': '2', '死亡': '0', '受 傷': '2'}, '17': {'年齡層': '80歲-84歲', '人數': '2', '死亡': '0', '受傷': '2'}, '18': {'年齡層': '17歲', '人數': '1', '死亡': '0', '受傷': '1'}, '19': {'年齡層': '90歲以上', '人數': '1', '死亡': '0', '受傷': '1'}}}, '僑光科技大學': {'肇因': {'1': {'肇事原因': '其他未依規定讓車', '件數': '35', '死亡': '0', '受傷': '47'}, '2': {'肇事原因': '未注意車前狀況', '件數': '15', '死亡': '0', '受傷': '21'}, '3': {'肇事原因': '其他不當駕車行為', '件數': '13', '死亡': '0', '受傷': '15'}, '4': {'肇事原因': '未保持行車安全距離', '件數': '8', '死亡': '0', '受傷': '15'}, '5': {'肇事原因': '左轉彎未依規定', '件數': '5', '死亡': '0', '受傷': '8'}, '6': {'肇事原因': '不明原因肇事', '件數': '5', '死亡': '0', '受傷': '5'}, '7': {'肇事原因': '有號誌路口，轉彎車未讓直行車先行', '件數': '4', '死亡': '0', '受傷': '7'}, '8': {'肇事原因': '起步時未注意安 全', '件數': '4', '死亡': '0', '受傷': '6'}, '9': {'肇事原因': '迴轉未依規定', '件數': '4', '死亡': '0', '受傷': '5'}, '10': {'肇事原因': '違反號誌管制或指揮', '件數': '3', '死亡': '0', '受傷': '5'}, '11': {'肇事原因': '車輛未依規定暫停讓行人先行', '件數': '3', '死亡': '0', '受傷': '3'}, '12': {'肇事原因': '變換車道不當', '件數': '2', '死亡': '0', '受傷': '5'}, '13': {'肇事原因': '右轉彎未依規定', '件數': '2', '死亡': '0', '受傷': '2'}, '14': {'肇事原因': '違反特定標誌(線)禁制', '件數': '2', '死亡': '0', '受傷': '2'}, '15': {'肇事原因': '闖紅燈直行', '件數': '2', '死亡': '0', '受傷': '2'}, '16': {'肇事原因': '觀看其他事故 、活動、道路環境或車外資訊分心駕駛', '件數': '1', '死亡': '0', '受傷': '2'}, '17': {'肇事原因': '未依規定減速', '件數': '1', '死亡': '0', '受傷': '1'}, '18': {'肇事原因': '未靠右行駛', '件數': '1', '死亡': '0', '受傷': '1'}, '19': {'肇事原因': '車輛駕駛者-尚未發現肇事因素', '件數': '1', '死亡': '0', '受傷': '1'}, '20': {'肇事原因': '恍神、緊張、心不在焉分心駕駛', '件數': '1', '死亡': '0', '受傷': '1'}, '21': {'肇事原因': '相關跡證不足且無具體影像畫面，當事人各執一詞，經分析後無法釐清肇事原因', '件數': '1', '死亡': '0', '受傷': '1'}, '22': {'肇事原因': '無號誌路口，轉彎車未讓直行車先行', '件數': '1', '死亡': '0', '受傷': '1'}, '23': {'肇事原因': '違反其他標誌(線)禁制', '件數': '1', '死亡': '0', '受傷': '1'}, '24': {'肇事原因': '違反遵行方向標誌(線)', '件數': '1', '死亡': '0', '受傷': '1'}, '25': {'肇事原因': '違規超車', '件數': '1', '死亡': '0', '受傷': '1'}}, '年齡': {'1': {'年齡層': '20歲-24歲', '人數': '61', '死亡': '0', '受傷': '46'}, '2': {'年齡層': '18歲-19歲', '人數': '46', '死亡': '0', '受傷': '38'}, '3': {'年齡層': '25歲-29歲', '人數': '26', '死亡': '0', '受傷': '21'}, '4': {'年齡層': '35歲-39歲', '人數': '20', '死亡': '0', '受傷': '9'}, '5': {'年齡層': '40歲-44歲', '人數': '18', '死亡': '0', '受傷': '11'}, '6': {'年齡層': '55歲-59 歲', '人數': '15', '死亡': '0', '受傷': '5'}, '7': {'年齡層': '30歲-34歲', '人數': '15', '死亡': '0', '受傷': '4'}, '8': {'年齡層': '45歲-49歲', '人數': '13', '死亡': '0', '受傷': '7'}, '9': {'年齡層': '50歲-54歲', '人數': '12', '死亡': '0', '受傷': '4'}, '10': {'年齡層': '不明', '人數': '9', '死亡': '0', '受傷': '0'}, '11': {'年齡層': '60歲-64歲', '人數': '8', '死亡': '0', '受傷': '3'}, '12': {'年齡層': '65歲-69歲', '人數': '6', '死亡': '0', '受傷': '4'}, '13': {'年齡層': '70歲-74歲', '人數': '5', '死亡': '0', '受傷': '4'}, '14': {'年齡層': '80歲-84歲', '人數': '2', '死亡': '0', '受傷': '1'}, '15': {'年齡層': '17歲', '人 數': '2', '死亡': '0', '受傷': '0'}, '16': {'年齡層': '14歲', '人數': '1', '死亡': '0', '受傷': '1'}, '17': {'年齡層': '15歲', '人數': '1', '死亡': '0', '受傷': '1'}, '18': {'年齡層': '13歲', '人數': '1', '死亡': '0', '受傷': '0'}, '19': {'年齡層': '16歲', '人數': '1', '死亡': '0', '受傷': '0'}}}}
    for schoolName in data:
        causeData = data[schoolName]['肇因'].values()
        # print(causeData)
        # for row in causeData:
        #     causeData[row]['件數'] = int(causeData[row]['件數'])
        # print(causeData)
        sortedCauseData = sorted(causeData, key=lambda row: row['件數'], reverse=True)
        print(sortedCauseData)

    # print(data)
    # drawBarChart(data, ['死亡', '受傷'])